# Example 3

INSERT INTO SELECT

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# The INSERT INTO SELECT statement copies data from one table and inserts it into another table.
# The INSERT INTO SELECT statement requires that the data types in source and target tables match.
# Note: The existing records in the target table are unaffected.
query = '''
            INSERT INTO Customers (CustomerID, CustomerName, City, Country)
            SELECT SupplierID, SupplierName, City, Country 
            FROM Suppliers
        '''
cur.execute(query);

## Show table

In [4]:
query = '''
            SELECT * 
            FROM Customers
        '''
df = pd.read_sql_query(query, con)
df.tail()

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
115,25,Ma Maison,None,None,Montréal,None,Canada
116,26,Pasta Buttini s.r.l.,None,None,Salerno,None,Italy
117,27,Escargots Nouveaux,None,None,Montceau,None,France
118,28,Gai pâturage,None,None,Annecy,None,France
119,29,Forêts d`érables,None,None,Ste-Hyacinthe,None,Canada

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    120 non-null    int64
 1   CustomerName  120 non-null    object
 2   ContactName   91 non-null     object
 3   Address       91 non-null     object
 4   City          120 non-null    object
 5   PostalCode    91 non-null     object
 6   Country       120 non-null    object
dtypes: int64(1), object(6)
memory usage: 6.7+ KB

## Close the connection

In [6]:
con.close()